// на странице регистрации
export const CONFLICT_EMAIL =
    "Пользователь с таким email уже существует";
export const REGISTRATION_ERROR =
    "При регистрации пользователя произошла ошибка";
export const INVALID_DATA =
    "Переданы неверные данные. Неверно заполнено одно из полей";

// на странице логина пользователя
export const AUTH_ERROR = "Вы ввели неправильный логин или пароль";

// на странице обновления профиля
export const PROFILE_EDIT_ERROR = "При обновлении профиля произошла ошибка"

// другие
export const SERVER_ERROR = "500 На сервере произошла ошибка";
export const MOVIES_NOT_FOUND = "По Вашему запросу ничего не было найдено";
export const MOVIES_SERVER_ERROR =
    "Во время запроса произошла ошибка. Возможно, проблема с соединением или сервер недоступен. Подождите немного и попробуйте ещё раз";

export const SUCCESS_EDIT = "Данные упешно обновлены!";

